Rails/Rails_Views/tester/app/controllers/users_controller.rb

    def index
        #get an array of all users, make it available to view
        @users = User.all
---
SELECT "users".* FROM "users"