SQL/Active_Record/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def self.shorten_url(user, long_url)
        ShortenedUrl.create!(
            long_url: long_url,
            short_url: self.random_code,
            user_id: user.id
        )

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "ksUYE_3CAHUljE0jZeDqcA"], ["LIMIT", 1]]
---
    def self.random_code
        good_code = false

        while !good_code
            short_url_string = SecureRandom.urlsafe_base64(16)
            good_code = true unless ShortenedUrl.exists?(short_url: short_url_string)

SELECT "visits".* FROM "visits"
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 1]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 1]]
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."shortened_url_id" = $1  [["shortened_url_id", 1]]
SELECT "shortened_urls".* FROM "shortened_urls"
SELECT  1 AS one FROM "visits" WHERE "visits"."shortened_url_id" = $1 LIMIT $2  [["shortened_url_id", 5], ["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."shortened_url_id" = $1  [["shortened_url_id", 5]]
DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 5]]
---
    def self.prune(n)
        #get visited urls older than n minutes and remove them from database
        Visit.all.each do |visit|
            #debugger
            next if !ShortenedUrl.exists?(visit.shortened_url_id) || visit.visitor.premium
            if visit.created_at < n.minutes.ago
                ShortenedUrl.find(visit.shortened_url_id).destroy
            end
        end

        #get urls that haven't been visited and remove them from database if they are older than n minutes
        ShortenedUrl.all.each do |shortened_url|
            if !Visit.exists?(shortened_url_id: shortened_url.id) && !shortened_url.submitter.premium
                shortened_url.destroy if shortened_url.created_at < n.minutes.ago

SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."created_at" BETWEEN $1 AND $2 AND "shortened_urls"."user_id" = $3  [["created_at", "2022-09-06 05:29:16.301851"], ["created_at", "2022-09-06 05:30:16.301886"], ["user_id", 1]]
---
    def no_spamming
        if ShortenedUrl.where(created_at: 1.minute.ago..Time.current, user_id: user_id).length == 5

SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 1]]
---
    def nonpremium_max
        if ShortenedUrl.where(user_id: user_id).length >= 5