SQL/Active_Record/URLShortener/app/models/shortened_url.rb

SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."created_at" BETWEEN $1 AND $2 AND "shortened_urls"."user_id" = $3  [["created_at", "2022-09-06 02:26:14.481563"], ["created_at", "2022-09-06 02:27:14.481596"], ["user_id", 1]]
---
    def no_spamming
        if ShortenedUrl.where(created_at: 1.minute.ago..Time.current, user_id: user_id).length == 5

SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 1]]
---
    def nonpremium_max
        if ShortenedUrl.where(user_id: user_id).length >= 11