Rails/Rails_Views/library/app/controllers/books_controller.rb

    def show
        @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @book = Book.new(book_params)

        if @book.save
---
INSERT INTO "books" ("title", "author", "year", "category", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def update
        @book = Book.find_by(id: params[:id])

        if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1, "description" = $2, "updated_at" = $3 WHERE "books"."id" = $4