SQL/Active_Record_II/polls_app/app/models/response.rb

    def sibling_responses_version2
        Response.joins(answer_choice: :question).where('questions.id': self.question_id).where.not('responses.user_id': self.user_id)
---
SELECT  "questions".* FROM "questions" INNER JOIN "answer_choices" ON "questions"."id" = "answer_choices"."question_id" WHERE "answer_choices"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def does_not_respond_to_own_poll_version2
        poll = Poll.joins(questions: :answer_choices).where('polls.user_id': question.poll.id).first
---
SELECT  "polls".* FROM "polls" INNER JOIN "questions" ON "questions"."poll_id" = "polls"."id" INNER JOIN "answer_choices" ON "answer_choices"."question_id" = "questions"."id" WHERE "polls"."user_id" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]