Rails/Routes_and_Controllers/art_share_api/app/controllers/artwork_shares_controller.rb

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def show
        render json: ArtworkShare.find(params[:id])
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)

        if artwork_share.artwork_id && artwork_share.viewer_id
            artwork_share.save!
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 1], ["artwork_id", 10], ["created_at", "2023-02-07 21:39:17.587297"], ["updated_at", "2023-02-07 21:39:17.587297"]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        render json: artwork_share if artwork_share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 21]]

    def favorite
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.favorite = true
        artwork_share.save!
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "updated_at" = $1, "favorite" = $2 WHERE "artwork_shares"."id" = $3  [["updated_at", "2023-02-18 08:23:20.505144"], ["favorite", true], ["id", 1]]