Rails/Routes_and_Controllers/art_share_api/app/controllers/artworks_controller.rb

    def create
        artwork = Artwork.new(artwork_params)

        if artwork.title && artwork.image_url && artwork.artist_id
            artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Jake Art4"], ["image_url", "Jake Art4 URL"], ["artist_id", 1], ["created_at", "2023-02-07 20:20:57.698250"], ["updated_at", "2023-02-07 20:20:57.698250"]]

    def destroy
        artwork = Artwork.find(params[:id])
        render json: artwork if artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 9]]

    def favorite
        artwork = Artwork.find(params[:id])
        artwork.favorite = true
        artwork.save!
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "updated_at" = $1, "favorite" = $2 WHERE "artworks"."id" = $3  [["updated_at", "2023-02-18 08:06:02.397776"], ["favorite", true], ["id", 1]]