Rails/Routes_and_Controllers/art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        if params[:author_id]
            render json: User.find(params[:author_id]).comments
        elsif params[:artwork_id]
            render json: Artwork.find(params[:artwork_id]).comments
        else
            render json: Comment.all

INSERT INTO "comments" ("author_id", "artwork_id", "created_at", "updated_at", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 3], ["artwork_id", 9], ["created_at", "2023-02-17 01:29:33.825501"], ["updated_at", "2023-02-17 01:29:33.825501"], ["body", "Mary comment2 on Ann Art3"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.author_id && comment.artwork_id && comment.body
            comment.save!

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 19]]
---
    def destroy
        comment = Comment.find(params[:id])
        render json: comment if comment.destroy