Rails/Routes_and_Controllers/art_share_api/app/controllers/users_controller.rb

    def index
        if params[:username]
            render json: User.where(username: params[:username])
        elsif query_in_request_params?
            name = get_name_from_query
            user = User.select(:id, :username, :created_at, :updated_at).where(username: name)
            if user != []
                render json: user
            else
                render plain: "User not in database."
            end
        else
            render json: User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "'Jake'"], ["LIMIT", 1]]
SELECT "users"."id", "users"."username", "users"."created_at", "users"."updated_at" FROM "users" WHERE "users"."username" = $1  [["username", "Jake"]]
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)

        if user.username
            user.save!
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Jake"], ["created_at", "2023-02-07 02:41:28.016572"], ["updated_at", "2023-02-07 02:41:28.016572"]]

    def destroy
        user = User.find(params[:id])
        render json: user if user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]