Rails/Routes_and_Controllers/art_share_api/app/controllers/users_controller.rb

    def destroy
        user = User.find(params[:id])
        render json: user if user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]