Rails/Routes_and_Controllers/art_share_api/app/models/artwork.rb

    def self.artworks_for_user_id(user_id)
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]